package 原反补码;

public class OriginalInverseComplement {
    public static void main(String[] args){
        //原码:十进制数据的二进制表现形式,最左边是符号位,0为正,1为负
        //0111 1111 --> 127
        //1111 1111 --> -127
        //利用原码对正数进行计算是不会有问题的,但如果是负数,结果就出错了,实际运算的结果跟预期相反

        //反码:为了解决原码不能计算负数的问题而出现的
        //计算规则:正数的反码不变,负数的反码在原码的基础上,符号位不变,数值取反,0变1,1变0;
        //-56的反码 --> 1100 0111
        //-56+1=-55;
        //1100 0111
        //0000 0001
        //1100 1000 -->-55的反码
        //1011 0111 -->-55的原码
    }
}
